{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Scrambled Brains for Breakfast",
	"language": "en",
	"home_page_url": "https://example.com/",
	"feed_url": "https://example.com/feed/feed.json",
	"description": "A place to throw my scrambled brains against the wall to see what sticks.",
	"author": {
		"name": "Sam Westwood",
		"url": "https://sam.thewestwoods.us"
	},
	"items": [
		{
			"id": "https://example.com/blog/2024-02-25-snorkeling/",
			"url": "https://example.com/blog/2024-02-25-snorkeling/",
			"title": "Snorkeling",
			"content_html": "<h1 id=\"snorkeling\" tabindex=\"-1\">Snorkeling <a class=\"header-anchor\" href=\"https://example.com/blog/2024-02-25-snorkeling/\">#</a></h1>\n<p>I am now a T-mobile Home Internet customer. It uses 4G LTE and 5G cellular networks to provide internet connectivity. They provide you with a cellular modem/router with a wifi hotspot and a couple of ethernet ports. I figured out how to disable the wifi and connected it to the WAN port of my UDM Pro. Easy-peasy.</p>\n<p>There are some trade offs. There is some variability in the signal quality, which translates to extra latency some of the time. The cellular networks also use CG-NAT and <strong>T-mobile does not provide a public IP address.</strong></p>\n<p>I could get around this by setting up some <em>Cloudflare tunnels</em>. They are easy and work great. The main problem is that I want to control my own SSL certificates. Cloudflare creates a wildcard certificate for subdomains (*.mydomain.io), but only root level subdomains. Inside my LAN I use sub-subdomains. For example, <em>service.computername</em>.mydomain.io. For publicly exposed services I prefer using the same URL inside my LAN and over WAN, and Cloudflare tunnels are not able to give me that.</p>\n<p>My LAN is now diving beneath the depths CG-NAT. I need a snorkel.</p>\n<pre class=\"language-txt\" tabindex=\"0\"><code class=\"language-txt\">    public ip (vps)\n\n     |  s  |\n/\\/\\/|  n  |\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n     |  o  |  Deep Waters of CG-NAT\n     |  r  |\n     |  k  |\n     |  e  |\n     |  l  |\n     \\     \\________\n      \\  tailscale --> DMZ --> LAN\n       \\____________\n</code></pre>\n<p>So basically, I’ve got a VPS with a public IP. It connects to my DMZ proxy server through my Tailscale tailnet. The VPS forwards any traffic it receives on ports 80 and 443 to the proxy server. <strong>¡Viola! A snorkel!</strong></p>\n<h2 id=\"forwarding-packets\" tabindex=\"-1\">Forwarding Packets <a class=\"header-anchor\" href=\"https://example.com/blog/2024-02-25-snorkeling/\">#</a></h2>\n<p>My initial thought was to turn my VPS into a router. I tried using iptables to forward ports, but I’m not very good at writing rules and had a few problems. I couldn’t figure out how to forward packets through tailscale. 🤔 After some more searching around the interwebs I found an old program called <em><a href=\"https://github.com/samhocevar/rinetd\">rinetd</a></em>.</p>\n<h3 id=\"rinetd-setup\" tabindex=\"-1\">rinetd setup <a class=\"header-anchor\" href=\"https://example.com/blog/2024-02-25-snorkeling/\">#</a></h3>\n<p><em>rinetd</em> silently forwards tcp and udp traffic. It is found in most linux package managers. I’m using an Ubuntu server, so I installed it with an easy <code>sudo apt install rinetd</code>. The configuration file is found in <code>/etc/rinetd.conf</code>. The main section looks like this:</p>\n<pre class=\"language-bash\" tabindex=\"0\"><code class=\"language-bash\"><span class=\"token comment\"># bindaddress bindport connectaddress connectport</span>\n<span class=\"token number\">137.184</span>.89.83 <span class=\"token number\">80</span> <span class=\"token number\">100.86</span>.67.77 <span class=\"token number\">80</span>\n<span class=\"token number\">137.184</span>.89.83 <span class=\"token number\">443</span> <span class=\"token number\">100.86</span>.67.77 <span class=\"token number\">443</span></code></pre>\n<p>The <code>bindaddress</code> is the public ip of the VPS, and the <code>connectaddress</code> is the tailnet address of the proxy server. Easy. After updating the configuration, run a quick <code>systemctl start rinetd</code> and you are set. No need to mess with forwarding rules. It just works.</p>\n<p>Time to make more coffee.</p>\n",
			"date_published": "2024-02-25T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/2024-02-24-diving-into-the-deep/",
			"url": "https://example.com/blog/2024-02-24-diving-into-the-deep/",
			"title": "Diving into the deep",
			"content_html": "<h1 id=\"diving-into-the-deep\" tabindex=\"-1\">Diving into the deep <a class=\"header-anchor\" href=\"https://example.com/blog/2024-02-24-diving-into-the-deep/\">#</a></h1>\n<p>Recently I had a little <em>snafu</em> with Xfinity. I have been an Xfinity customer for more than a decade. In my area, it has really been the <em>only</em> option for high-speed internet connections. I have always felt uneasy about the leverage that Xfinity has had over the market. I hate the equipment fees, and the lack of good customer service. I refused to use an Xfinity router or modem, instead opting to buy my own.</p>\n<p>A few years ago they implemented a data cap, and I — untrusting of the monopoly-induced power of the company — purchased a UDM Pro SE and started measuring my own data usage. Throughout these years the usage reported by Xfinity was typically higher than my own measurements, but within a reasonable margin of error. However, that changed in December of 2023. During that month the UDM Pro measured about 800GB of throughput, and Xfinity reported a whopping <strong>2400GB</strong> of usage! <strong>Three times more</strong>!</p>\n<p>I walked in to the nearest Xfinity store intending to ask for a service ticket. <s>However, I was told in no uncertain terms that <em><strong>the Lord God of Xfinity</strong></em> in it's <em><strong>mighty Glory</strong></em> and <em><strong>omnicient knowing</strong></em> is the <em>only</em> source of <strong>truth</strong>. My own paltry attempt at measuring throughput was meaningless. <em>Xfinity's</em> mighty judgement would not be questioned! How dare I question it?</s> <em>Okay, okay... those were not their exact words, but they are not <strong>that</strong> hyperbolic either.</em> They refused to submit a service ticket on my behalf, and told me to quietly pay the bill of over $300, <s>and that I should leave with a <em>smile</em> on my face</s>.</p>\n<p><strong>Instead I left with a solid resolve to cancel my account.</strong> I saw the commercials for T-Mobile Home Internet, advertised for $50 a month with <em>unlimited</em> data usage. It actually ended up being slightly cheaper than that since I am an existing T-mobile customer. It offers better speeds than any other ISP in my area besides Xfinity, and I am happy with my choice (so far). A week or so later I closed my Xfinity account and I am not looking back.</p>\n<p>T-mobile home internet brings some additional challenges. Namely, I am now sitting behind a messy CG-NAT. I do not have a public IP address to access my home network. If you google around a bit, most people solve this by using a <em>Cloudflare</em> tunnel. I have used them before, and it is an easy and effective solution, even providing ssl certificates automatically. But, <em>I</em> prefer doing things the <em>hard</em> way. It's the only way to learn something new.</p>\n<p>This post is getting quite long. Now that you know the backstory, I will post the <em>exciting</em> details of my own personal solution to these problems.</p>\n<p>Time to make more coffee.</p>\n",
			"date_published": "2024-02-24T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/fourthpost/",
			"url": "https://example.com/blog/fourthpost/",
			"title": "This is my fourth post.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://example.com/img/IdthKOzqFA-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://example.com/img/IdthKOzqFA-350.webp 350w\"><img alt=\"A possum parent and two possum kids hanging from the iconic red balloon\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/IdthKOzqFA-350.png\" width=\"350\" height=\"685\"></picture></p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://example.com/blog/fourthpost/\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-09-30T00:00:00Z"
		}
		
	]
}
